<a href="#" id="hw"></a>
<div style="background: #000;
            color: #FFF;
            margin: 0px;
                padding: 10px 0px 20px 0px;
            text-align: center; 
                ">
    <h1 style="padding: 0px 0px 0px 0px;">Week 15 Lab</h1>
</div>

In [1]:
import pandas as pd

# Exercise 1

a) Create a dictionary with fake data and use it to create a dataframe

In [2]:
df = pd.DataFrame(
        {
            "Book": [
                "1 Av",
                "179 St - Jamaica",
                "59 St",
                "149 St - 3 Av"
            ],
            "Trains": [('L'), ('F'), ('N','R'),('2','5')],
            "Elevator": [2, 3, 3, 2],
            "Escalator": [0, 0, 0, 0]
       })

In [3]:
df

               Book  Trains  Elevator  Escalator
0              1 Av       L         2          0
1  179 St - Jamaica       F         3          0
2             59 St  (N, R)         3          0
3     149 St - 3 Av  (2, 5)         2          0

b) Create a list of values and use it to create a series.

In [4]:
working_elevators = pd.Series([1, 2, 3, 2], name="Elevator")

working_elevators

0    1
1    2
2    3
3    2
Name: Elevator, dtype: int64

c) Using either the dataframe or the series above, output the count, mean and standard deviation of it.

In [5]:
# DataFrame
df["Elevator"].max()

3

In [6]:
# Series
working_elevators.max()

3

# Exercise 2

For the next parts of today's lab we will be using the `grades.csv` file in `/datasets`.

In [7]:
# initial imports

# import pandas as pd

df = pd.read_csv("../datasets/grades.csv")

In [8]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

a) Output the first 5 rows of the dataframe

In [9]:
df.head(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

b) Output the last 5 rows of the dataframe

In [10]:
df.tail(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

c) tail is the shape of this dataframe?

In [11]:
gender_female = df[df["gender"] == 'female']

gender_female.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
5,female,group B,associate's degree,standard,none,71,83,78
6,female,group B,some college,standard,completed,88,95,92

In [12]:
gender_female.shape

(518, 8)

In [13]:
df.shape

(1000, 8)

d) How many columns are there with no values? How much memory does this df use?

In [14]:
# How many columns are there with no values?
df.isnull().any()

gender                         False
race/ethnicity                 False
parental level of education    False
lunch                          False
test preparation course        False
math score                     False
reading score                  False
writing score                  False
dtype: bool

In [15]:
# df.notna()

In [16]:
# How much memory does this df use?
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

e) Create a new column called "total score" that is the sum of the math, reading and writing score. Output the dataframe

In [17]:
# the math, reading and writing score colums
df["total score"] = df["math score"] + df["reading score"] + df["writing score"]

In [18]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,total score
0,female,group B,bachelor's degree,standard,none,72,72,74,218
1,female,group C,some college,standard,completed,69,90,88,247
2,female,group B,master's degree,standard,none,90,95,93,278
3,male,group A,associate's degree,free/reduced,none,47,57,44,148
4,male,group C,some college,standard,none,76,78,75,229
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,282
996,male,group C,high school,free/reduced,none,62,55,55,172
997,female,group C,high school,free/reduced,completed,59,71,65,195
998,female,group D,some college,standard,completed,68,78,77,223
999,female,group D,some college,free/reduced,none,77,86,86,249

f) Create a new column called "average score" that is the average of the math, reading, and writing scores. Output the dataframe.

In [19]:
df["average score"] = df["math score"] / df["reading score"] / df["writing score"]

In [20]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,total score,average score
0,female,group B,bachelor's degree,standard,none,72,72,74,218,0.013514
1,female,group C,some college,standard,completed,69,90,88,247,0.008712
2,female,group B,master's degree,standard,none,90,95,93,278,0.010187
3,male,group A,associate's degree,free/reduced,none,47,57,44,148,0.018740
4,male,group C,some college,standard,none,76,78,75,229,0.012991
...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,282,0.009357
996,male,group C,high school,free/reduced,none,62,55,55,172,0.020496
997,female,group C,high school,free/reduced,completed,59,71,65,195,0.012784
998,female,group D,some college,standard,completed,68,78,77,223,0.011322
999,female,group D,some college,free/reduced,none,77,86,86,249,0.010411

In [21]:
average = df[["math score", "reading score", "writing score"]].mean()
average

math score       66.089
reading score    69.169
writing score    68.054
dtype: float64

g) What is the average `total score` for each gender? What is the average `avg score` for each gender?

In [24]:
# What is the average total score for each gender?
df.groupby(["gender","total score"])["total score"].mean()

gender  total score
female  27              27
        55              55
        78              78
        88              88
        89              89
                      ...
male    281            281
        282            282
        293            293
        296            296
        300            300
Name: total score, Length: 326, dtype: int64

# What is the average total score for all gender?
df[["gender","total score"]].median()

In [27]:
# What is the average avg score for each gender?
df.groupby(["gender","average score"])["average score"].mean()

gender  average score
female  0.000000         0.000000
        0.008153         0.008153
        0.008445         0.008445
        0.008623         0.008623
        0.008676         0.008676
                           ...
male    0.045977         0.045977
        0.046296         0.046296
        0.052448         0.052448
        0.064073         0.064073
        0.083333         0.083333
Name: average score, Length: 946, dtype: float64

# What is the average total score for all gender?
df[["gender","average score"]].median()

h) What is the average math score for each category of lunch? What about reading, writing, total and avg score

i) What is the descriptive statistics for each category of `parental level of education`? What about reading, writing, total and avg score

j) What are the average scores (for all score columns) for each category of `test preparation course`?

k) Output only the score columns

l) What rows have `avg scores` lower than 80? What percent of the total is that? (try to calculate the last part programmatically)

m) What are the `avg score`, `gender` and `lunch` columns for all students with avg scores above 90. Sort it in descending order by `avg score`. Store it to a new dataframe and then output the new dataframe.

m) How many rows are in the new dataframe? What percent of the new dataframe are female? What percent receive free/reduced lunch?

n) Using the original dataframe, what is the `avg score` for each of the `gender`, `lunch` and `parental education level` column combinations?

o) Sort the original dataframe by `gender` and `lunch` in descending order

p) Based on your exercises above, what sort of inferences can you make so far? What would you want to look further into? What factor seems to affect `avg` score the most? Explain your answer.